// # language: ru
//
// Функционал: Поиск данных в StatusUpdate
//   Как пользователь админ
//   Я должен иметь возможность находить сущность
//   После ввода данных
//
//   @statusUpdateFilter
//   Сценарий: Поиск по вкладке Status Update
//     Допустим я захожу на страницу "login"
//     Если я введу данные:
//       | email    | admin@gmail.com |
//       | password | admin           |
//     И нажимаю на кнопку "Sign In"
//     То я вижу текст "HELLO, ADMIN"
//     Допустим я открываю страницу "status-update"
//     То я ввожу данные в поле поиска
//     Если я введу следующие данные "Mirbek"
//     То я вижу "Mirbek"